---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures
source: html/7ffbc8e2-24f6-3630-cb1e-91cc393dd111.htm
---
# BuiltInFailures.DesignOptionFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.